---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsBarsNumberChanged
source: html/f9c25fd6-9a2b-3256-87f5-5263b81b50ae.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsBarsNumberChanged Property

Indicates if the bar number has changed since the last regeneration.

## Syntax (C#)
```csharp
public bool IsBarsNumberChanged { get; }
```